"""54) Учитель предложил детям потренироваться в действиях с шестнадцатеричными
цифрами и поиграть в такую игру. Учитель предлагает детям три шестнадцатеричные цифры.
Ученики должны сначала найти сумму первой и второй цифр, потом — сумму второй и третьей
цифр. Обе суммы должны быть записаны, как шестнадцатеричные числа. Затем эти числа
записываются друг за другом в порядке убывания.
Пример. Исходные цифры: А, А, З. Суммы: А + А = 14; А + З = D. Результат: 14D. Укажите, какое из
следующих чисел может быть получено в результате.
1) 214
2) 904
3) F4
4) G4"""
'Вар. 4 не подходит тк > F(16)'
'Вар. 1 не подходит тк 2(16) < 14(16) и 21 < 1E(16) ( = F(16) + F(16))'
'Вар. 2 не подходит тк 90(16) < 1E(16) и 04 - не записывается в 16 системе'
print(3)
