"""9) Для составления цепочек используются разноцветные бусины: темные - красная (К), синяя (С),
зеленая (З), и светлые - желтая (Ж), белая (Б). На первом месте в цепочке стоит бусина красного,
синего или белого цвета. В середине цепочки - любая из светлых бусин, если первая бусина
темная, и любая из темных бусин, если первая бусина светлая. На последнем месте - одна из
бусин белого, желтого или синего цвета, не стоящая в цепочке в середине. Какая из
перечисленных цепочек создана по этому правилу?
1) кжс
2) БКЗ
3) сзж
4) зкс"""
"""
Вариант 2) у него цвет З в конце -> не подходит по усл.

Вариант 3) 2 темных подряд -> не подходит по усл.

Вариант 4) у него цвет з в начале -> не подходит по усл.
"""
print(1)
