"""Музыкальный фрагмент был оцифрован и записан в виде файла без использования окатия
данных. Получившийся файл был передан в город А по каналу связи за 20 секунд. Затем тот же
музыкальный фрагмент был оцифрован повторно с разрешением в 6 раз выше и частотой
дискретизации в 4 раз меньше, чем в первый раз. Сжатие данных не производилось. Полученный
файл был передан в город Б за 10 секунд. Во сколько раз пропускная способность канала связи с
городом Б выше, чем канала связи с городом А? В ответе запишите только целое число."""
print(3)
