"""Сколько существует четных пятеричных чисел длиной 6, начинающихся с цифры 3?"""
print(810 + 720 + 32)
