"""Ася составляет 7-буквенные слова из букв А, П, Е, Л, Ь, С, И, Н. Все буквы слова
различны. Буква Ь, если встречается, стоит между двумя согласными. Сколько таких слов может
составить Ася?"""
print(12240)
