"""76) (А.Н. Носкин, г. Москва) Дано слово КОРАБЛИКИ. Таня решила составлять новые 5-буквенные
слова из букв этого слова по следующим правилам: 1) слово начинается с гласной буквы; 2)
гласные и согласные буквы в слове должны чередоваться; 3) буквы в слове не должны
повторяться. Сколько существует таких слов?"""
print(3 * 5 * 2 * 4 * 3)
